/**
 * Created by henryleu on 3/31/16.
 */

/**
 *  易信错误代码描述映射表
 */
module.exports = {
    "190": "API调用基础设施错误",
    "191": "API调用返回数据JSON解析错误",

    //基础错误码
    "200": "操作成功",
    "201": "客户端版本不对，需升级sdk",
    "301": "被封禁",
    "302": "用户名或密码错误",
    "315": "IP限制",
    "403": "非法操作或没有权限",
    "404": "对象不存在",
    "405": "参数长度过长",
    "406": "对象只读",
    "408": "客户端请求超时",
    "413": "验证失败(短信服务)",
    "414": "参数错误",
    "415": "客户端网络问题",
    "416": "频率控制",
    "417": "自动登录失效",
    "418": "通道不可用(短信服务)",
    "419": "数量超过上限",
    "422": "账号被禁用",
    "431": "HTTP重复请求",
    "500": "服务器内部错误",
    "503": "服务器繁忙",
    "514": "服务不可用",
    "509": "无效协议",
    "998": "解包错误",
    "999": "打包错误",

    //群相关错误码
    "801": "群人数达到上限",
    "802": "没有权限",
    "803": "群不存在",
    "804": "用户不在群",
    "805": "群类型不匹配",
    "806": "创建群数量达到限制",
    "807": "群成员状态错误",
    "808": "申请成功",
    "809": "已经在群内",
    "810": "邀请成功",

    //音视频、白板通话相关错误码
    "9102": "通道失效",
    "9103": "已经在他端对这个呼叫响应过了",
    "11001": "通话不可达，对方离线状态",

    //聊天室相关错误码
    "13001": "IM主连接状态异常",
    "13002": "聊天室状态异常",
    "13003": "账号在黑名单中,不允许进入聊天室",
    "13004": "在禁言列表中,不允许发言",

    //特定业务相关错误码
    "10431": "输入email不是邮箱",
    "10432": "输入mobile不是手机号码",
    "10433": "注册输入的两次密码不相同",
    "10434": "企业不存在",
    "10435": "登陆密码或帐号不对",
    "10436": "app不存在",
    "10437": "email已注册",
    "10438": "手机号已注册",
    "10441": "app名字已经存在"
};